Revit 2027 API
FabricationPart.GetStiffenerInfo Method
 Gets the stiffener information for the fabrication part.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public int GetStiffenerInfo(
	int index,
	out bool locked
)
Public Function GetStiffenerInfo (
	index As Integer,
	<OutAttribute> ByRef locked As Boolean
) As Integer
public:
int GetStiffenerInfo(
	int index,
	[OutAttribute] bool% locked
)
member GetStiffenerInfo :
        index : int *
        locked : bool byref -> int
Parameters
index Int32
 The index of the stiffener to get.
locked Boolean
 The locked status to be returned.
Return Value
Int32
 Returns the database identifier of the stiffener.
Exceptions
Exception | Condition
ArgumentOutOfRangeException |  The stiffener index is out of range.
See Also
Reference
FabricationPart Class
Autodesk.Revit.DB Namespace